Revit 2027 API
ParameterTypeId.PathReinEndHookTypen2 Property
 "Alternating Bar - End Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinEndHookTypen2 { get; }
Public Shared ReadOnly Property PathReinEndHookTypen2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinEndHookTypen2 {
	ForgeTypeId^ get ();
}
static member PathReinEndHookTypen2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace